# _*_ coding:utf-8 _*_
# __author__JackColor__

"""
38.报数

 报数序列指一个整照　　其中的　整数的顺序金属序列，按行数报数，得到下一个数

 1.     1
 2.    11
 3.    21
 4.    1211
 5.    111221


"""
# *********************************************#


"""
53.最大子序列

给定一个整数数组　nums 找到　一个具有最大和的连续子数组(子数组最少包含一个元素),返回其最大和

eg: [-2,1,-3,4,-1,2,1,-5,4]

res: 6 

[4,-1,2,1]  ++> 6


"""








"""
58.

给定一个仅包含大小写字母跟空格的字符串，　返回其最后一个单词的长度
如果不存在最后一个单词　则返回　０

eg : "Hello World "


res: 5





"""
